
## :x: Apply Failed (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8670560391)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.public_image_bucket will be created
  + resource "google_storage_bucket" "public_image_bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "AP-NORTHEAST-1"
      + name                        = "lgtm-public-image-bucket"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + cors {
          + max_age_seconds = 3600
          + method          = [
              + "GET",
            ]
          + origin          = [
              + "",
            ]
          + response_header = [
              + "*",
            ]
        }
    }

  # google_storage_bucket_access_control.public_image_bucket will be created
  + resource "google_storage_bucket_access_control" "public_image_bucket" {
      + bucket = "lgtm-public-image-bucket"
      + domain = (known after apply)
      + email  = (known after apply)
      + entity = "allUsers"
      + id     = (known after apply)
      + role   = "READER"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
google_storage_bucket.public_image_bucket: Creating...
╷
│ Error: googleapi: Error 400: The specified location constraint is not valid., invalid
│ 
│   with google_storage_bucket.public_image_bucket,
│   on gcs.tf line 7, in resource "google_storage_bucket" "public_image_bucket":
│    7: resource "google_storage_bucket" "public_image_bucket" {
│ 
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terraform-apply","PRNumber":2,"Program":"tfcmt","SHA1":"1192a193917185e31e405e38bcf95a359cec4baa","Target":"dev","Vars":{},"WorkflowName":"Run Terragrunt Apply on main branch push"} -->